<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"d4cbde7678682f83a3587b0e5ddb62b2e168a1c32b9eaa5610d402546fa40f41","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1318 at https://github.com/cal-itp/data-infra/actions/runs/20837854320","plan_out_hash":"49116def7754d9ccb822bce29a8bb605ae9bc0c268ed5bb8215d83623cbb8c53","plan_hash":"3451fe0ae9667c0f06526121d2301b12c9008d67075365d931b623cf54feeb1f","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "gy5+Ww==" -> (known after apply)
!~      detect_md5hash      = "oQ0NFwG6omyH07TnV7kh6Q==" -> "different hash"
!~      generation          = 1765993228054833 -> (known after apply)
        id                  = "calitp-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "oQ0NFwG6omyH07TnV7kh6Q==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "fSyMug==" -> (known after apply)
!~      detect_md5hash      = "LXFQhCCXUHqK/ErVasSLvA==" -> "different hash"
!~      generation          = 1767749389460040 -> (known after apply)
        id                  = "calitp-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "LXFQhCCXUHqK/ErVasSLvA==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "eGR9kw==" -> (known after apply)
!~      detect_md5hash      = "wvrzaQr9Khb3P+18/jA/2g==" -> "different hash"
!~      generation          = 1767648590625242 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "wvrzaQr9Khb3P+18/jA/2g==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "EYV24w==" -> (known after apply)
!~      detect_md5hash      = "hrGWSQnQHlZQ99/ZjeykQg==" -> "different hash"
!~      generation          = 1767721054974824 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "hrGWSQnQHlZQ99/ZjeykQg==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "sjIQ3w==" -> (known after apply)
!~      detect_md5hash      = "F20c+qNAWzVNPlr8UfLEkQ==" -> "different hash"
!~      generation          = 1765308834178242 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "F20c+qNAWzVNPlr8UfLEkQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "aa0zBg==" -> (known after apply)
!~      detect_md5hash      = "DB0rN1eMI6EmyMzB+/Q/0A==" -> "different hash"
!~      generation          = 1765308834177868 -> (known after apply)
        id                  = "calitp-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "DB0rN1eMI6EmyMzB+/Q/0A==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1318](https://github.com/cal-itp/data-infra/actions/runs/20837854320)